[
    {
        "id": 1,
        "title": "Spider-Man: No Way Home",
        "synopsis": "Identitas Spider-Man sekarang sudah terungkap, dan Peter meminta bantuan Doctor Strange. namun sebuah kesalahan terjadi, dan itu justru mengundang musuh berbahaya dari dunia lain, mereka mulai bermunculan. Hal itu memaksa Peter mencari apa makna sebenarnya menjadi Spider-Man.",
        "trailerUrl": "https://www.youtube.com/embed/JfVOs4VSpmA?si=xe37sZuDD360tMD6",
        "imgUrl": "https://m.media-amazon.com/images/M/MV5BZWMyYzFjYTYtNTRjYi00OGExLWE2YzgtOGRmYjAxZTU3NzBiXkEyXkFqcGdeQXVyMzQ0MzA0NTM@._V1_FMjpg_UX1000_.jpg",
        "rating": 8,
        "genreId": 1,
        "authorId": 1
    },
    {
        "id": 2,
        "title": "You are The Apple of My Eye",
        "synopsis": "Ching-teng adalah siswa yang penuh perjuangan. Ketika kepala sekolah menempatkannya di samping Chia-yi, siswi yang cerdas dan cantik, keberuntungan dan perasaannya terhadap gadis itu pun berubah.",
        "trailerUrl": "https://www.youtube.com/embed/v5H6wE47FrI?si=ddQOtZH8cnBa7Oly",
        "imgUrl": "https://m.media-amazon.com/images/M/MV5BMWU2OTAyMTktMTU5MC00MTNhLTg1NzAtOTZjNWFjMDRiZGUxXkEyXkFqcGdeQXVyNDY3MzUxOTI@._V1_.jpg",
        "rating": 8,
        "genreId": 2,
        "authorId": 1
    },
    {
        "id": 3,
        "title": "Three Idiots",
        "synopsis": "Di kampus, Farhan dan Raju terlihat sangat akrab dengan Rancho. Bertahun-tahun kemudian, sebuah taruhan akhirnya memberi mereka kesempatan untuk mencari kembali teman yang telah lama hilang.",
        "trailerUrl": "https://www.youtube.com/embed/u88oMxFiCIc?si=Ng1YCQM2CcnSgmwN",
        "imgUrl": "https://m.media-amazon.com/images/M/MV5BNTkyOGVjMGEtNmQzZi00NzFlLTlhOWQtODYyMDc2ZGJmYzFhXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
        "rating": 7,
        "genreId": 3,
        "authorId": 1
    },
    {
        "id": 4,
        "title": "John Wick",
        "synopsis": "Saat mantan pembunuh bayaran bernama John Wick baru saja kehilangan istrinya Helen karena penyakit kronis. Sebelum meninggal, Helen memberikan hadiah terakhir untuk John berupa seekor anak anjing bernama Daisy. Ia berharap, Daisy bisa membantu sang suami mengatasi kesedihannya.",
        "trailerUrl": "https://www.youtube.com/embed/C0BMx-qxsP4?si=tMXifq87o4sL9Nqc",
        "imgUrl": "https://m.media-amazon.com/images/M/MV5BMTU2NjA1ODgzMF5BMl5BanBnXkFtZTgwMTM2MTI4MjE@._V1_.jpg",
        "rating": 7,
        "genreId": 1,
        "authorId": 1
    },
    {
        "id": 5,
        "title": "Doctor Strange in the Multiverse of Madness",
        "synopsis": "Semua bermula saat Doctor Strange terus mengalami mimpi aneh. Salah satunya adalah saat dirinya sedang berusaha melarikan diri dari monster di sebuah semesta yang asing. Dalam mimpinya, ia bersama dengan seorang gadis, dan terlihat melewati pijakan yang terus berpindah untuk menghindar. Sampai di ujung jalan, mereka bertemu dengan benda mirip dengan The Book of Vishanti. Ia dihadapkan pada dilema, harus mengambil buku tersebut guna mengalahkan monster, atau menyelamatkan sang gadis kecil. Ia kemudian terbangun. Mimpi aneh terus ia alami, dan berbagai sosok muncul dari mimpinya yang berbeda-beda. Semua selalu berkaitan dengan dirinya pada satu dunia yang asing dan tak dikenali, menghadapi masalah, dan terus berlari.",
        "trailerUrl": "https://www.youtube.com/embed/aWzlQ2N6qqg?si=b_09tBhWpCYiOGh4",
        "imgUrl": "https://m.media-amazon.com/images/M/MV5BNWM0ZGJlMzMtZmYwMi00NzI3LTgzMzMtNjMzNjliNDRmZmFlXkEyXkFqcGdeQXVyMTM1MTE1NDMx._V1_.jpg",
        "rating": 8,
        "genreId": 1,
        "authorId": 1
    }
]